
{
  "title":"Calendar",
  "content":" LEC # TOPICS KEY DATES 1 Catalan numbers: drunkard\u0026rsquo;s walk problem, generating function, recurrence relation. 2 Catalan numbers (cont.): formula for Cn, reflection principle, necklaces, triangulations of polygons, plane binary trees, parenthesizations. 3 Pattern avoidance in permutations. Stack- and queue-sortable permutations. Young diagrams and Young tableaux. Hook-length formula. 4 Frobenius-Young identity. Schensted correspondence. Longest increasing and decreasing subsequences in permutations. 5 Proof of the hook-length formula based on a random hook walk. 6 Hook walks (cont.). Linear extensions of posets. Hook-length-type formulas for shifted shapes and trees. 7 q-factorials and q-binomial coefficients. 8 Grassmannians over finite fields: Gaussian elimination and row-reduced echelon form. 9 Sets and multisets. Statistics on permutations: inversions, cycles, descents. 10 Statistics on permutations (cont.). Equidistributed statistics. Major index. Records. Exceedances. Stirling numbers. 11 Stirling numbers (cont.). Set-partitions. Rook placements on triangular boards. Non-crossing and non-nesting set-partitions. 12 Eulerian numbers. Increasing binary trees. 3 Pascal-like triangles: Eulerian triangles, Stirling triangles of 1st and 2nd kind. Problem set 1 due 13 Discussion of problem set 1. 14 Discussion of problem set 1 (cont.). 15 Posets and lattices. Boolean lattice. Partition lattice. Young\u0026rsquo;s lattice. 16 Distributive lattices. Birkhoff\u0026rsquo;s fundamental theorem for finite distributive lattices. 17 Sperner\u0026rsquo;s property. Symmetric chain decompositions. Sperner\u0026rsquo;s and Dilworth\u0026rsquo;s theorems. Greene\u0026rsquo;s theorem. 18 Greene\u0026rsquo;s theorem vs Schensted correspondence. Up and down operators. Differential posets. 19 Differential posets (cont.). Fibonacci lattice. Unimodality of Gaussian coefficients. 20 Proof of unimodality of Gaussian coefficients (cont.). Theory of partitions. Euler\u0026rsquo;s pentagonal number theorem. 21 Partition theory (cont.). Franklin\u0026rsquo;s combinatorial proof of Euler\u0026rsquo;s pentagonal number theorem. Jacobi\u0026rsquo;s triple product identity. 22 Partition theory (cont.). Combinatorial proof of Jacobi\u0026rsquo;s triple product identity. Enumeration of trees. Cayley\u0026rsquo;s formula. Simple inductive proof of Cayley\u0026rsquo;s formula. 23 Two combinatorial proofs of Cayley\u0026rsquo;s formula. Problem set 2 due 24 Discussion of problem set 2. 25 Discussion of problem set 2 (cont.). 26 Matrix Tree Theorem. Spanning trees. Laplacian matrix of a graph. Reciprocity formula for spanning trees. Examples: complete graphs, complete bipartite graphs. 27 Matrix Tree Theorem (cont.). Products of graphs. Number of spanning trees in the hypercube graph. Oriented incidence matrix. 28 Proof of Matrix Tree Theorem using Cauchy-Binnet formula. Weighted and directed version of Matrix Tree Theorem. In-trees and out-trees. 29 Proof of Directed Matrix Tree Theorem based on induction. 30 Proof of Directed Matrix Tree Theorem via the Involution Principle. Electrical Networks and Kirchhoff\u0026rsquo;s Laws. 31 Electrical networks (cont.). Kirchhoff\u0026rsquo;s matrix. Relations of electrical networks with Matrix Tree Theorem and spanning trees. Series-parallel connections. Probabilistic interpretation of the electrical potential in terms of random walks on graphs. 32 Eulerian cycles in digraphs and B.E.S.T. theorem. 33 Parking functions. Tree inversion polynomials. 34 Pascal triangle. Bernoulli numbers. Riemann zeta function. Binary trees. Catalan numbers. 35 Lindstrom-Gessel-Viennot lemma. Lindstrom Theorem. 36 Proof of Lindstrom-Gessel-Viennot lemma. Weighted version of Lindstrom-Gessel-Viennot lemma. Plane partitions. 37 MacMahon Proposition. Rhombus tiling. Domino tiling. Kasteleyn Theorem. Temperley Theorem. Problem set 3 due 38 Discussion of problem set 3. 39 Plane partitions. Symmetric polynomials. Semi-standard Young tableau. Schur polynomial. Jacobi-Trudi Theorem. Hook-content formula. "}


